custom/key-bindings.org
#+TITLE: Kostafey's Emacs configuration
#+OPTIONS: toc:4 h:4
#+STARTUP: content
* Initial setup

Add to .emacs:

(load-file "~/.emacs.d/init.el")

* Kostafey's keybindings
** Humane emacs
*** Exit/hide emacs
| Key          | Command                    | Description |
|--------------+----------------------------+-------------|
| M-z          | iconify-or-deiconify-frame |             |
| M-&lt;f4&gt; | save-buffers-kill-terminal |             |

#+begin_src emacs-lisp :exports none :padline no
  ;;; key-bindings.el -- A collection of key bindings (default and custom).

  ;;; Commentary:

  ;; Attempting to make emacs a little bit humane.

  ;;=============================================================================
  ;; Exit & iconify emacs
  (global-set-key (kbd "M-z") 'iconify-or-deiconify-frame)    ; Hide emacs frame
  (global-set-key (kbd "C-M-e") 'eframe-pop-emacs)
  (global-set-key (kbd "M-<f4>") 'save-buffers-kill-terminal)
  (global-set-key [escape] 'keyboard-quit)

  ;;=============================================================================
  ;; CUA - the core of the emacs humane ;)
  ;;
  (require 'cua-base)
  (require 'hopper)
  (cua-mode t)
  (setq cua-prefix-override-inhibit-delay 0.1)
  ;;
  ;; Region selection:
  (setq transient-mark-mode t)
#+end_src

*** Select Copy Paste
| Key   | Command                         | Description                         |
|-------+---------------------------------+-------------------------------------|
| C-S-v | cua-paste-pop                   |                                     |
| C-M-v | (cua-paste-pop -1)              |                                     |
| C-M-c | lambda                          | Append selected text to temp buffer |
| C-e   | cua-exchange-point-and-mark     |                                     |
| C-S-e | (cua-exchange-point-and-mark 1) | Exchange and select                 |
| C-a   | mark-whole-buffer               |                                     |
| M-s   | set-mark-command                | (As old C-SPC)                      |

#+begin_src emacs-lisp :exports none
  ;;-----------------------------------------------------------------------------
  (global-set-key (kbd "C-S-v") 'cua-paste-pop)
  (global-set-key (kbd "C-M-v") '(lambda() (interactive) (cua-paste-pop -1)))

  (global-set-key (kbd "C-M-c") '(lambda(beg end) (interactive "r")
                                   (append-to-buffer "temp" beg end)
                                   (save-excursion
                                     (set-buffer "temp")
                                     (insert "\n"))))
  ;;-----------------------------------------------------------------------------
  (global-set-key (kbd "C-e") 'cua-exchange-point-and-mark)
  (global-set-key (kbd "C-S-e") '(lambda() (interactive) (cua-exchange-point-and-mark 1)))
  ;;-----------------------------------------------------------------------------
  (global-set-key (kbd "C-a") 'mark-whole-buffer)
  (global-set-key (kbd "M-s") 'set-mark-command)
  ;;-----------------------------------------------------------------------------

  ;;----------------------------------------------------------------------
  ;; multiple-cursors
  ;;
  (when (require 'multiple-cursors nil 'noerror)
    ;; When you have an active region that spans multiple lines, the following will
    ;; add a cursor to each line:
    (global-set-key (kbd "C-S-m") 'mc/edit-lines)
    ;; When you want to add multiple cursors not based on continuous lines, but
    ;; based on keywords in the buffer, use:
    (global-set-key (kbd "C->") 'mc/mark-next-like-this)
    (global-set-key (kbd "C-<") 'mc/mark-previous-like-this)
    (global-set-key (kbd "C-c C-<") 'mc/mark-all-like-this))
  ;;
  ;;----------------------------------------------------------------------
#+end_src

*** Undo/redo
| Key   | Command | Description |
|-------+---------+-------------|
| C-z   | undo    |             |
| C-S-z | redo    |             |
| C-'   | repeat  |             |

#+begin_src emacs-lisp :exports none
  (require 'redo)
  (global-unset-key "\C-_")

  (global-set-key (kbd "C-z") 'undo)              ; Undo C-z
  (global-set-key [(meta backspace)] 'undo)
  (global-set-key (kbd "C-S-z") 'redo)            ; Redo C-S-z

  (global-unset-key (kbd "C-'"))
  (global-set-key (kbd "C-'") 'repeat)
#+end_src

*** Delete/insert char
| Key | Command              | Description |
|-----+----------------------+-------------|
| C-b | backward-delete-char |             |
| C-d | delete-char          |             |
| C-q | quoted-insert        |             |

#+begin_src emacs-lisp :exports none
  (global-set-key "\C-b" 'backward-delete-char)
  (global-set-key "\C-d" 'delete-char)            ; delete
  (global-set-key "\C-q" 'quoted-insert)
  (global-set-key [(delete)] 'delete-char)
  ;; (global-set-key (kbd "M-SPC") 'just-one-space) - default
  (global-set-key (kbd "s-SPC") 'just-one-space)
#+end_src

*** Save/revert
| Key       | Command                          | Description |
|-----------+----------------------------------+-------------|
| C-s       | save-buffer                      |             |
| C-x r     | revert-buffer                    |             |
| C-x RET r | revert-buffer-with-coding-system |             |

#+begin_src emacs-lisp :exports none
  ;;-----------------------------------------------------------------------------
  (global-set-key (kbd "C-s") 'save-buffer)
  ;; Cancel all changes from last save
  (global-set-key (kbd "C-x r") 'revert-buffer)
  (global-set-key (kbd "C-x RET r") 'revert-buffer-with-coding-system)
#+end_src

#+begin_src emacs-lisp :exports none
  ;;=============================================================================
  ;; Keyboard prefixes
  ;;
  (global-unset-key "\C-\M-a")
  (defvar selected-area-prefix "\C-\M-a")
  (defvar change-buffer-prefix "\C-c\C-b")

  (require 'dired-conf)
  (require 'navigation-in-frame)
  (require 'navigation-in-buffer)
  (require 'basic-text-editing)
#+end_src

