custom/key-bindings.org
** Basic point movements & change buffer's position
| Key              | Command            | Description                 |
|------------------+--------------------+-----------------------------|
| C-&lt;right&gt;  | step-forward-word  | Like odinary editors, moves |
| C-&lt;left&gt;   | step-backward-word | forward word/backward word. |
| C-M-&lt;down&gt; | forward-sentence   |                             |
| C-M-&lt;up&gt;   | backward-sentence  |                             |

#+begin_src emacs-lisp :exports none
  ;;=============================================================================
  ;;           Basic point movements & change buffer's position
  ;;
  ;; Physical line navigation:
  ;; move up down end begin over the real visible screen lines
  (require 'physical-line)
  (physical-line-mode 1)

  (global-set-key (kbd "<up>")          'k/line-previous)
  (global-set-key (kbd "<down>")        'k/line-next)
  (global-set-key (kbd "S-<up>")        'k/line-previous-select)
  (global-set-key (kbd "S-<down>")      'k/line-next-select)

  (global-set-key (kbd "<right>")       'k/char-forward)
  (global-set-key (kbd "<left>")        'k/char-backward)
  (global-set-key (kbd "S-<right>")     'k/char-forward-select)
  (global-set-key (kbd "S-<left>")      'k/char-backward-select)

  (global-set-key (kbd "C-<right>")     'k/word-forward)
  (global-set-key (kbd "C-<left>")      'k/word-backward)
  (global-set-key (kbd "C-S-<right>")   'k/word-forward-select)
  (global-set-key (kbd "C-S-<left>")    'k/word-backward-select)

  (global-set-key (kbd "C-M-<right>")   'k/sexp-forward)
  (global-set-key (kbd "C-M-<left>")    'k/sexp-backward)
  (global-set-key (kbd "C-M-S-<right>") 'k/sexp-forward-select)
  (global-set-key (kbd "C-M-S-<left>")  'k/sexp-backward-select)

  (global-set-key (kbd "<end>")         'k/line-end)
  (global-set-key (kbd "<home>")        'k/line-beginning)
  (global-set-key (kbd "S-<end>")       'k/line-end-select)
  (global-set-key (kbd "S-<home>")      'k/line-beginning-select)
  (global-set-key (kbd "C-<home>")      'k/buffer-beginning)
  (global-set-key (kbd "C-<end>")       'k/buffer-end)
  (global-set-key (kbd "C-S-<home>")    'k/buffer-beginning-select)
  (global-set-key (kbd "C-S-<end>")     'k/buffer-end-select)

  (require 'expand-region)
  (global-set-key (kbd "C-=") 'er/expand-region)

  (put 'step-forward-word 'CUA 'move)
  (put 'step-backward-word 'CUA 'move)
  ;;-----------------------------------------------------------------------------
  (global-set-key (kbd "C-s-<down>") 'forward-sentence)
  (global-set-key (kbd "C-s-<up>") 'backward-sentence)
  ;;-----------------------------------------------------------------------------
  ;; cua-mode in org-mode
  (eval-after-load "org"
    '(progn
      (define-key org-mode-map (kbd "S-<left>") nil)
      (define-key org-mode-map (kbd "S-<right>") nil)
      (define-key org-mode-map (kbd "C-S-<left>") nil)
      (define-key org-mode-map (kbd "C-S-<right>") nil)
      (define-key org-mode-map (kbd "C-S-M-<left>") nil)
      (define-key org-mode-map (kbd "C-S-M-<right>") nil)
      (define-key org-mode-map (kbd "S-<up>") nil)
      (define-key org-mode-map (kbd "S-<down>") nil)
      (define-key org-mode-map (kbd "M-<up>") nil)
      (define-key org-mode-map (kbd "M-<down>") nil)
      (define-key org-mode-map (kbd "M-<left>") nil)
      (define-key org-mode-map (kbd "M-<right>") nil)
      (define-key org-mode-map (kbd "C-c C-p") 'k/el-pprint-eval-last-sexp)
      (define-key org-mode-map (kbd "C-a") nil)
      (define-key org-mode-map (kbd "M-a") nil)))

  ;;-----------------------------------------------------------------------------
  (require 'pager)
  ;; Bind scrolling functions from pager library.
  (global-set-key [next]     'pager-page-down)
  (global-set-key [prior]    'pager-page-up)
  ;;-----------------------------------------------------------------------------
  ;; Scrolling without point movement
  (global-set-key (kbd "C-l") 'recenter-top-bottom)

  (if (< emacs-major-version 24)
      (progn
      (global-set-key [(control down)] (lambda () (interactive) (scroll-up 1))) ; [C-down]
      (global-set-key [(control up)] (lambda () (interactive) (scroll-down 1)))) ; [C-up]
    (progn
      (global-set-key [(control down)] 'scroll-up-line) ; [C-down]
      (global-set-key [(control up)] 'scroll-down-line))) ; [C-up]
  ;;
  ;;=============================================================================
#+end_src

** Point hyper-jumps
*** Bookmarks
    | Key       | Command          |
    |-----------+------------------|
    | C-b       | bookmark-set     |
    | M-b       | bookmark-jump    |
    |-----------+------------------|
    | C-x x     | goto-last-change |
    | C-c left  | winner-undo      |
    | C-c right | winner-redo      |
#+begin_src emacs-lisp :exports none
  ;;=============================================================================
  ;;                         Point hyper-jumps
  ;;
  ;;-----------------------------------------------------------------------------
  ; bookmarks
  (global-set-key (kbd "C-b") 'bookmark-set)
  (global-set-key (kbd "M-b") 'bookmark-jump)
  ;;----------------------------------------------------------------------------
  (global-set-key (kbd "C-x x") 'goto-last-change)
#+end_src

*** Search & replace
    | Key        | Command                     |
    |------------+-----------------------------|
    | C-f        | isearch-forward             |
    | C-r        | isearch-backward            |
    | M-e        | isearch-edit-string         |
    | C-S-f      | flx-isearch-forward         |
    | C-S-r      | flx-isearch-backward        |
    |------------+-----------------------------|
    | M-r        | replace-string              |
    |------------+-----------------------------|
    | C-M-f      | ag                          |
    | C-c C-f    | ack-file                    |
    |------------+-----------------------------|
    | control F3 | highlight-symbol            |
    | F3         | highlight-symbol-next       |
    | shift F3   | highlight-symbol-prev       |
    | meta F3    | highlight-symbol-remove-all |
    | C-M-<up>   | highlight-symbol-prev       |
    | C-M-<down> | highlight-symbol-next       |
    |------------+-----------------------------|
    | M-a        | ace-jump-mode               |
#+begin_src emacs-lisp :exports none
  ;;-----------------------------------------------------------------------------
  ;; Search & replace
  ;;
  (global-unset-key (kbd "C-f"))
  (global-set-key (kbd "C-f") 'isearch-forward)
  (global-set-key (kbd "C-S-f") 'flx-isearch-forward)
  (global-set-key (kbd "C-r") 'isearch-backward)
  (global-set-key (kbd "C-S-r") 'flx-isearch-backward)
  ;;(global-set-key (kbd "M-e") 'isearch-edit-string) - default

  (defun k/isearch-mode-hook ()
    (define-key isearch-mode-map (kbd "C-f")    'isearch-repeat-forward)
    (define-key isearch-mode-map (kbd "C-r")    'isearch-repeat-backward)
    (define-key isearch-mode-map (kbd "C-v")    'isearch-yank-kill)
    (define-key isearch-mode-map (kbd "RET")    'k/isearch-ret)
    (define-key isearch-mode-map (kbd "<down>") 'k/isearch-down)
    (define-key isearch-mode-map (kbd "<up>")   'k/isearch-up))

  (add-hook 'isearch-mode-hook 'k/isearch-mode-hook)

  (global-unset-key (kbd "M-r"))
  (global-set-key (kbd "M-r") 'replace-string)

  ;; (global-set-key (kbd "C-M-f") 'ack) ;; instead of 'rgrep
  (global-set-key (kbd "C-M-f") 'ag)
  (global-set-key (kbd "C-c C-f") 'ack-file)

  (when (require 'highlight-symbol nil 'noerror)
    (eval-after-load "highlight-symbol"
      '(progn
         (global-set-key [(control f3)] 'highlight-symbol)
         (global-set-key [f3] 'highlight-symbol-next)
         (global-set-key [(shift f3)] 'highlight-symbol-prev)
         (global-set-key [(meta f3)] 'highlight-symbol-remove-all)
         (global-set-key (kbd "C-M-<up>") 'highlight-symbol-prev)
         (global-set-key (kbd "C-M-<down>") 'highlight-symbol-next))))

  (defun kostafey-markdown-mode-hook ()
    (define-key markdown-mode-map (kbd "C-M-<up>") 'highlight-symbol-prev)
    (define-key markdown-mode-map (kbd "C-M-<down>") 'highlight-symbol-next)
    (define-key markdown-mode-map (kbd "<backspace>") nil))
  (add-hook 'markdown-mode-hook 'kostafey-markdown-mode-hook)

  ;; ace-jump-mode
  (global-unset-key (kbd "M-a"))
  (when (require 'ace-jump-mode nil 'noerror)
    (define-key global-map (kbd "M-a") 'ace-jump-mode))
  ;;
  ;;=============================================================================
#+end_src

