custom/key-bindings.org
*** Intellectual point jumps
    | Key   | Command                | Description              |
    |-------+------------------------+--------------------------|
    |       | sgml-pretty-print      | Format selected xml.     |
    | C-n   | sgml-skip-tag-forward  |                          |
    | C-b   | sgml-skip-tag-backward |                          |
    |-------+------------------------+--------------------------|
    | C-M-d | hop-at-point           | Jump to elisp definition |
#+begin_src emacs-lisp :exports none
  ;;=============================================================================
  ;;                           Intellectual point jumps
  ;;
  ;;-----------------------------------------------------------------------------
  ;; html/xml tags navigation
  (defun k/define-xml-jumps (mode-map)
    ;; (require 'sgml-mode)
    (define-key mode-map (kbd "C-M-<right>") 'k/sgml-skip-tag-forward)
    (define-key mode-map (kbd "C-M-<left>") 'k/sgml-skip-tag-backward)
    (define-key mode-map (kbd "C-M-S-<right>") 'k/sgml-skip-tag-forward-select)
    (define-key mode-map (kbd "C-M-S-<left>") 'k/sgml-skip-tag-backward-select))
  (defun kostafey-html-mode-hook ()
    (k/define-xml-jumps html-mode-map))
  (defun kostafey-nxml-mode-hook ()
    (k/define-xml-jumps nxml-mode-map))
  (add-hook 'html-mode-hook 'kostafey-html-mode-hook)
  (add-hook 'nxml-mode-hook 'kostafey-nxml-mode-hook)
  ;;-----------------------------------------------------------------------------
  ;; goto definition
  (global-set-key (kbd "C-M-d") 'hop-at-point)
  ;;
  ;;=============================================================================
#+end_src

** Frames
    | Key   | Command     |
    |-------+-------------|
    | s-tab | other-frame |

#+begin_src emacs-lisp :exports none
  ;; Switch frame
  ;; C-x 5 o - default
  (global-set-key (kbd "s-<tab>") 'other-frame)
#+end_src

** Command executions
    | Key         | Command                  | Description          |
    |-------------+--------------------------+----------------------|
    | M-x         | smex                     |                      |
    | M-X         | smex-major-mode-commands |                      |
    | C-c C-c M-x | execute-extended-command | This is your old M-x |
#+begin_src emacs-lisp :exports none
  ;;=============================================================================
  ;;                              Command executions
  ;; smex configuration
  (global-set-key (kbd "M-x") 'smex)
  (global-set-key (kbd "M-X") 'smex-major-mode-commands)
  ;; This is your old M-x.
  (global-set-key (kbd "C-c C-c M-x") 'execute-extended-command)
  ;;
  ;;=============================================================================
#+end_src

** Text transformations
*** Basic text transformations
    | Key     | Command                    |
    |---------+----------------------------|
    | C-n     | newline                    |
    | C-o     | open-line                  |
    |---------+----------------------------|
    | M-t     | transpose-words            |
    | M-y     | transpose-words -1         |
    |---------+----------------------------|
    | C-j     | join-next-line-space-n     |
    | C-c j   | join-next-line-n           |
    | C-c C-j | join-next-line-semicolon-n |
    |---------+----------------------------|
    | C-c c   | center-line                |
    |---------+----------------------------|
    | C-M-k   | kill-whole-line            |
    | C-k     | kill-line                  |
    |---------+----------------------------|
    | C-S-c   | copy-line                  |
    | C-S-l   | mark-line                  |
    | C-c u   | copy-url                   |
    | C-c d   | duplicate-line             |
    |---------+----------------------------|
    | C-c C-l | toggle-truncate-lines      |
    |---------+----------------------------|
    | C-c q   | unfill-paragraph           |
#+begin_src emacs-lisp :exports none
  ;;=============================================================================
  ;;                        Text transformations
  ;;-----------------------------------------------------------------------------
  ;; Basic text transformations
  (global-set-key (kbd "C-n") 'newline)
  (global-set-key (kbd "C-o") 'open-line)
  ;;-----------------------------------------------------------------------------
  ;; Word operations
  (global-set-key (kbd "M-t") 'transpose-words)
  (global-set-key (kbd "M-y") '(lambda() (interactive) (transpose-words -1)))
  ;;-----------------------------------------------------------------------------
  ;; Line operations
  (global-set-key (kbd "C-j") 'join-next-line-space-n)
  (global-set-key (kbd "C-c j") 'join-next-line-n)
  (global-set-key (kbd "C-c C-j") 'join-next-line-semicolon-n)

  (global-set-key (kbd "C-c c") 'center-line)

  (global-set-key (kbd "C-M-k") 'kill-whole-line)
  (global-set-key (kbd "C-k") 'kill-line)

  (global-set-key (kbd "C-S-c") 'copy-line)
  (global-set-key (kbd "C-S-l") 'mark-line)
  (global-set-key (kbd "C-c u") 'copy-url)
  (global-set-key (kbd "C-c d") 'duplicate-line)
  ;; Toggle whether to fold or truncate long lines for the current buffer.
  (global-set-key (kbd "C-c C-l") 'toggle-truncate-lines)
  ;;-----------------------------------------------------------------------------
  ;; Paragraph operations
  (global-set-key (kbd "C-c q")  'unfill-paragraph)
  (global-set-key (kbd "C-c e")  'graph-easy-run)
#+end_src

*** Rectangle operations
    | Key     | Command                     |
    |---------+-----------------------------|
    | C-M-a n | rectangle-number-lines      |
    | C-M-a v | string-insert-rectangle     |
    | C-M-a c | copy-rectangle-to-clipboard |
    | C-M-a r | yank-rectangle              |
    | M-u     | cua-upcase-rectangle        |
#+begin_src emacs-lisp :exports none
  ;;-----------------------------------------------------------------------------
  ;; Rectangle operations
  (global-set-key (kbd "C-M-a n") 'rectangle-number-lines)
  (global-set-key (kbd "C-M-a v") 'string-insert-rectangle)
  (global-set-key (kbd "C-M-a c") 'copy-rectangle-to-clipboard)
  (global-set-key (kbd "C-M-a r") 'yank-rectangle)
  ;(global-set-key (kbd "M-u") 'cua-upcase-rectangle) - default
#+end_src

*** Upcase/downcase
    | Key        | Command                      |
    |------------+------------------------------|
    | C-S-<up>   | toggle-letter-case           |
    | C-S-<down> | toggle-camelcase-underscores |
#+begin_src emacs-lisp :exports none
  ;;-----------------------------------------------------------------------------
  ;; Upcase/downcase
  (global-set-key (kbd "C-S-<up>") 'toggle-letter-case)
  (global-set-key (kbd "C-S-<down>") 'toggle-camelcase-underscores)
  ;; (global-unset-key "\C-\M-c")
  (global-set-key (kbd "C-M-a l") 'downcase-region)
  (global-set-key (kbd "C-M-a d") 'downcase-region)
  (global-set-key (kbd "C-M-a u") 'upcase-region)
  (global-set-key (concat selected-area-prefix "u") 'upcase-region)
  (global-set-key (concat selected-area-prefix "l") 'downcase-region)
#+end_src

