custom/key-bindings.org
*** Region & misc operations
    | Key          | Command                   |
    |--------------+---------------------------|
    | C-M-a :      | align-by-column           |
    | C-M-a '      | align-by-quote            |
    | align-regexp | align-regexp              |
    |--------------+---------------------------|
    | C-;          | comment-or-uncomment-this |
    | C-/          | comment-or-uncomment-this |
    |--------------+---------------------------|
    | C-`          | u:en/ru-recode-region     |
    |--------------+---------------------------|
    | C-M-R        | replace-regexp            |
    | M-R          | query-replace             |
    | C-M-a k      | keep-lines                |
    | C-M-a f      | flush-lines               |
#+begin_src emacs-lisp :exports none
  ;;-----------------------------------------------------------------------------
  ;; Region & misc operations
  (global-set-key (kbd "C-M-a :") 'align-by-column)
  (global-set-key (kbd "C-M-a '") 'align-by-quote)
  (global-set-key (kbd "C-M-a a") 'align-regexp)

  (global-set-key (kbd "C-;") 'comment-or-uncomment-this)
  (global-set-key (kbd "C-/") 'comment-or-uncomment-this)

  (global-set-key (kbd "C-`") 'u:en/ru-recode-region)

  (global-set-key (kbd "C-M-R") 'replace-regexp)
  (global-set-key (kbd "M-R") 'query-replace)
  (global-set-key (kbd "C-M-a k") 'keep-lines)
  (global-set-key (kbd "C-M-a f") 'flush-lines)
  ;;
  ;;=============================================================================

  ;;=============================================================================
  ;; Meta - Навигация
  ;;=============================================================================
  (global-set-key "\M-g" 'goto-line)
  ;;l - влево j - вправо i - вверх k - вниз
  (global-set-key "\M-i" 'previous-line)
  (global-set-key "\M-k" 'next-line)
  (global-set-key "\M-j" 'backward-char)
  (global-set-key "\M-l" 'forward-char)

  (global-set-key "\C-cr" 'reposition-window)
  (global-unset-key "\M-\C-l")
  (global-set-key "\M-\C-j" 'backward-word)
  (global-set-key "\M-\C-l" 'forward-word)

  (global-set-key "\M-o" 'end-of-line)
  (global-set-key "\M-u" 'beginning-of-line)

  (global-set-key "\M-m" 'scroll-up)
  (global-set-key "\M-," 'scroll-down)

  (global-set-key "\M-M" '(lambda () (interactive) (scroll-up 1)))
  (global-set-key "\M-<" '(lambda () (interactive) (scroll-down 1)))

  ;;=============================================================================
  ;; Look changes
  ;;
  (global-set-key [(meta return)] 'toggle-fullscreen)
  ;; Folding
  (global-set-key [(control meta tab)] 'fold-dwim-toggle-selective-display)
  ;; Change font size
  ;; (global-set-key (kbd "C-+")      '(lambda nil (interactive) (djcb-zoom 1)))
  ;; (global-set-key [C-kp-add]       '(lambda nil (interactive) (djcb-zoom 1)))
  ;; (global-set-key (kbd "C--")      '(lambda nil (interactive) (djcb-zoom -1)))
  ;; (global-set-key [C-kp-subtract]  '(lambda nil (interactive) (djcb-zoom -1)))
  ;;
  ;;=============================================================================

  ;;=============================================================================
  ;; Gathering information
  ;;
  (global-set-key (kbd "C-?") 'describe-char)
  (global-set-key "\C-\M-a\C-c" 'count-words-region)
  (global-set-key (kbd "M-p") 'copy-to-clipboard-buffer-file-path)
  (global-set-key (kbd "M-f") 'copy-to-clipboard-buffer-file-name)
  (global-set-key (kbd "C-p") 'copy-to-clipboard-git-branch)
  ;;
  ;;=============================================================================
#+end_src

