custom/key-bindings.el
;; Buffers navigation
;;
(global-set-key (kbd "C-w") 'eframe-kill-buffer)
(global-set-key (kbd "C-c w") 'kill-other-buffers)
(global-set-key (kbd "C-x w") 'kill-buffer)
(global-set-key (kbd "C-c k") 'delete-this-buffer-and-file)

;; (global-set-key (kbd "C-x <right>") 'next-buffer) - default
;; (global-set-key (kbd "C-x <left>") 'previous-buffer) - default

(global-set-key [(control next)] 'eframe-next-buffer)      ; C-Page Up
(global-set-key [(control prior)] 'eframe-previous-buffer) ; C-Page Down

(global-set-key (kbd "C-x a s") 'find-file-from-clipboard)

;;-----------------------------------------------------------------------------
;; tabbar - switch buffers by tabs
(global-set-key [(shift super left)] 'tabbar-backward-tab)
(global-set-key [(ctrl super left)] 'tabbar-backward-tab)
(global-set-key [(shift super right)] 'tabbar-forward-tab)
(global-set-key [(ctrl super right)] 'tabbar-forward-tab)
(global-set-key [(ctrl shift prior)] 'tabbar-backward-tab)
(global-set-key [(ctrl shift next)] 'tabbar-forward-tab)
;;-----------------------------------------------------------------------------
;; ido - switch buffers by completiotion
(require 'ido)
(ido-mode t)
(global-set-key (kbd "C-x C-f") 'ido-find-file)
(global-set-key (kbd "C-c f") 'ido-choose-from-recentf)
(global-set-key (kbd "C-x f") ; the plain prompt for file path
                '(lambda () (interactive)
                   (find-file (read-from-minibuffer "Enter file path: "))))
(global-set-key (kbd "C-x C-r") 'sudo-edit)
(global-set-key (kbd "C-x b") 'ido-switch-buffer)
(global-set-key (concat change-buffer-prefix "b") 'switch-to-buffer)
;;-----------------------------------------------------------------------------
;; ibuffer - list of all buffers
(global-set-key (kbd "C-x C-b") 'ibuffer)
;;-----------------------------------------------------------------------------
(require 'bs) ;; other list of buffers
(global-set-key (kbd "C-x C-n") 'bs-show)
;;-----------------------------------------------------------------------------
;; buffers shortcuts
(global-set-key (concat selected-area-prefix "\C-e")
                '(lambda () (interactive) (find-file "~/.emacs.d/init.el")))
(global-set-key (concat change-buffer-prefix "e")
                '(lambda () (interactive) (find-file "~/.emacs.d/init.el")))

(when (require 'temporary-persistent nil 'noerror)
  (global-set-key (kbd "C-x C-c") 'temporary-persistent-switch-buffer))

(global-set-key (concat change-buffer-prefix "p")
                '(lambda () (interactive) (find-file "~/.org.gpg")))
(global-set-key (concat change-buffer-prefix "k")
                '(lambda () (interactive) (find-file "~/.keys.org")))
(global-set-key (concat change-buffer-prefix "k")
                '(lambda () (interactive) (find-file "~/.keys.org")))
(global-set-key (kbd "C-x m")
                '(lambda () (interactive) (switch-to-buffer "*Messages*")))

(global-set-key (kbd "C-c g") 'google)
(global-set-key (kbd "C-x g") 'goto-url)
(global-set-key (kbd "C-c C-g") '(lambda () (interactive) (google -1)))
(global-set-key (kbd "C-c t") 'google-translate-at-point)
(global-set-key (kbd "C-c T") 'google-translate-query-translate)
;;
;;=============================================================================

;;=============================================================================
;; Windows navigation
;;
(global-set-key [M-f2] 'swap-windows)

(global-unset-key (kbd "M-m"))
(global-set-key (kbd "M-m") 'mirror-window)

(global-set-key [(control tab)] 'other-window) ; C-tab switchs to a next window
(windmove-default-keybindings 'meta)           ; M-up/down/left/right

(defun kostafey-markdown-mode-hook ()
  (define-key markdown-mode-map (kbd "M-<left>") nil)
  (define-key markdown-mode-map (kbd "M-<right>") nil))
(add-hook 'markdown-mode-hook 'kostafey-markdown-mode-hook)

(global-set-key (kbd "M-<left>") 'meta-left)
(global-set-key (kbd "M-<right>") 'meta-right)

(global-set-key (kbd "s-<left>") 'shrink-window-horizontally)
(global-set-key (kbd "s-<right>") 'enlarge-window-horizontally)
(global-set-key (kbd "s-<down>") 'shrink-window)
(global-set-key (kbd "s-<up>") 'enlarge-window)
;;
;;=============================================================================

(global-set-key (kbd "C-SPC") 'start-complete) ;; to 'set-mark-command use M-s instead
;;-----------------------------------------------------------------------------
;; auto-complete-mode
(define-key ac-complete-mode-map [next] 'ac-page-next)
(define-key ac-complete-mode-map [prior] 'ac-page-previous)
(define-key ac-complete-mode-map (kbd "C-f") 'ac-isearch)

;;-----------------------------------------------------------------------------
;; company-mode
(define-key company-search-map [escape] 'company-search-abort)
(define-key company-active-map [escape] 'company-abort)
(define-key company-active-map (kbd "<up>") 'k/company-select-previous)
(define-key company-active-map (kbd "<down>") 'k/company-select-next)
(define-key company-active-map [next] 'company-next-page)
(define-key company-active-map [prior] 'company-previous-page)
(define-key company-active-map (kbd "C-f") 'company-search-candidates)

;;=============================================================================
;; Function keys
;;
(global-set-key [f1] 'psw-switch-buffer)
(global-set-key [M-f1] (lambda () (interactive) (psw-switch-buffer t)))
(global-set-key (kbd "C-S-n") 'psw-switch-projectile-files)
(global-set-key (kbd "M-n") 'psw-switch-projectile-projects)
(global-set-key (kbd "s-q") 'psw-navigate-files)
(global-set-key (kbd "s-a") 'psw-navigate-files)
(global-set-key [f2] 'psw-switch-function)

(global-set-key [f4] 'k/shell)
(global-set-key [f5] 'dired-open)
(global-set-key [f6] 'switch-completion-frontend)
(global-set-key [f7] (lambda () (interactive)
                       (if (projectile-project-root)
                           (command-execute 'rg-project)
                         (command-execute 'rg))))
(global-set-key [S-f7] 'rg)
(global-set-key [C-f7] 'ack-file)

(require 'reencoding-file)
(global-set-key [f8] 'recode-buffer-rotate-ring)
(global-set-key [f9] 'auto-fill-mode); enable/disable lines auto-fill
(global-set-key [f10] 'flyspell-english)
(global-set-key [f11] 'flyspell-russian)
(global-set-key [f12] 'flyspell-mode); enable/disable spell checking
;; yasnippet
(defvar yasnippet-prefix "\C-y")
(global-unset-key yasnippet-prefix)
(global-set-key (concat yasnippet-prefix "n") 'yas/new-snippet)
(global-set-key (concat yasnippet-prefix "f") 'yas/find-snippets)
(global-set-key (concat yasnippet-prefix "v") 'yas/visit-snippet-file)
(global-set-key (concat yasnippet-prefix "r") 'yas/reload-all)

(global-set-key (kbd "S-<tab>") 'open-line-or-yas)
(global-set-key (kbd "C-S-<tab>") 'yas-prev-field)
;;
;;=============================================================================

;;============================================================================
