custom/key-bindings.el
;; Paredit customization
;;
(put 'paredit-forward 'CUA 'move)
(eval-after-load "paredit"
  '(progn
    (define-key paredit-mode-map (kbd "C-M-f") nil)
    (define-key paredit-mode-map (kbd "C-<left>") nil)  ; C-}
    (define-key paredit-mode-map (kbd "C-M-<left>") nil)
    (define-key paredit-mode-map (kbd "C-<right>") nil) ; C-)
    (define-key paredit-mode-map (kbd "C-M-<right>") nil)
    (define-key paredit-mode-map (kbd "C-M-<up>") nil)
    (define-key paredit-mode-map (kbd "M-<up>") nil)
    (define-key paredit-mode-map (kbd "M-<down>") nil)
    (define-key paredit-mode-map (kbd "C-j") nil)
    (define-key paredit-mode-map (kbd "C-S-M-n") 'paredit-newline)
    (define-key paredit-mode-map (kbd "C-d") nil)
    (define-key paredit-mode-map (kbd "<delete>") nil)
    (define-key paredit-mode-map (kbd "<DEL>") nil)
    (define-key paredit-mode-map (kbd "<deletechar>") nil)
    (define-key paredit-mode-map (kbd "<backspace>") nil)
    (define-key paredit-mode-map (kbd "M-r") nil)
    (define-key paredit-mode-map (kbd "M-C-'") 'paredit-raise-sexp)
    (define-key paredit-mode-map (kbd ")") 'nil)
    (define-key paredit-mode-map (kbd "]") 'nil)
    (define-key paredit-mode-map (kbd "\\") 'nil)
    (define-key paredit-mode-map (kbd "\"") 'nil)
    (define-key paredit-mode-map (kbd "C-M-d") 'nil)
    (define-key paredit-mode-map (kbd "M-q") 'nil)
    (define-key paredit-mode-map (kbd "M-r") 'nil)))

(eval-after-load "paredit-everywhere"
  '(progn
     (define-key paredit-everywhere-mode-map (kbd "M-r") 'replace-string)))

(global-set-key [(meta super right)] 'transpose-sexps)
(global-set-key [(meta super left)] (lambda () (interactive) (transpose-sexps -1)))
;;
;;============================================================================

(defun kostafey-lsp-signature-mode-map ()
  (define-key lsp-signature-mode-map (kbd "M-a") 'ace-jump-mode))
(add-hook 'lsp-signature-mode-map-hook 'kostafey-lsp-signature-mode-map)

;;=============================================================================
;; ecb
(global-set-key (kbd "\e M-l") 'ecb-toggle-ecb-windows)
(global-set-key (kbd "M-w") 'ecb-toggle-ecb-windows)
;; (global-set-key (kbd "C-x C-a") 'ecb-activate)
(global-set-key (kbd "C-x C-q") 'ecb-deactivate)
;; (global-set-key "\M-m" 'ecb-goto-window-methods)
;;
;;=============================================================================

(global-set-key (kbd "M-S-<left>") 'hop-backward)
(global-set-key (kbd "M-S-<right>") 'hop-forward)

;;=============================================================================
;; Mode keys & programming language specific keys.
;;
;;----------------------------------------------------------------------
;; Java
(defun kostafey-java-mode-hook ()
  (define-key java-mode-map (kbd "C-a") nil)
  (define-key java-mode-map (kbd "C-h j") 'javadoc-lookup)
  (define-key java-mode-map (kbd "C-<f1>") 'javadoc-lookup)
  (define-key java-mode-map (kbd "C-M-d") 'hop-at-point))
(add-hook 'java-mode-hook 'kostafey-java-mode-hook)

(global-set-key (kbd "C-<f10>") 'tomcat-toggle)
(global-set-key (kbd "C-<f9>") 'maven-tomcat-deploy)

;;----------------------------------------------------------------------
;; lisp
(defun kostafey-lisp-mode-hook ()
  (define-key lisp-mode-map (kbd "M-p") 'copy-to-clipboard-buffer-file-path)
  (define-key lisp-mode-map (kbd "C-c h") 'slime-hyperspec-lookup)
  (define-key slime-mode-map (kbd "M-p") 'copy-to-clipboard-buffer-file-path)
  (define-key slime-mode-map (kbd "C-c h") 'slime-hyperspec-lookup))
(add-hook 'lisp-mode-hook 'kostafey-lisp-mode-hook)
(add-hook 'slime-mode-hook 'kostafey-lisp-mode-hook)

;;----------------------------------------------------------------------
;; emacs lisp
(defun kostafey-elisp-mode-hook ()
  (define-key emacs-lisp-mode-map (kbd "C-c C-p")
    'k/el-pprint-eval-last-sexp)
  (define-key emacs-lisp-mode-map (kbd "C-n e b")
    (lambda () (interactive)
      (eval-buffer)
      (message "Elisp buffer evaluated."))))
(add-hook 'emacs-lisp-mode-hook 'kostafey-elisp-mode-hook)

;;----------------------------------------------------------------------
;; CIDER - Nrepl.el
;;
(global-unset-key (kbd "C-n"))
(defun kostafey-clojure-mode-hook ()
  (define-key clojure-mode-map (kbd "C-c C-p") 'cider-pprint-eval-last-sexp)
  (define-key clojure-mode-map (kbd "C-n j") 'cider-jack-in)
  (define-key clojure-mode-map (kbd "C-n e b") 'my-cider-eval-buffer)
  (define-key clojure-mode-map (kbd "C-x C-e") 'cider-eval-last-sexp)
  (define-key clojure-mode-map (kbd "C-n q") 'cider-quit)
  (define-key clojure-mode-map (kbd "C-h j") 'javadoc-lookup)
  (define-key clojure-mode-map (kbd "C-M-d") 'hop-at-point)
  (define-key clojure-mode-map (kbd "C-c C-l") nil)
  (define-key clojure-mode-map (kbd "C-c C-f") nil)
  (define-key clojure-mode-map (kbd "C-c C-f") 'ack-file))
(add-hook 'clojure-mode-hook 'kostafey-clojure-mode-hook)
(global-set-key (kbd "C-<f5>") 'initialize-cljs-repl)
