custom/key-bindings.org
*** Lua
    | Key     | Command                  |
    |---------+--------------------------|
    | C-c C-l | lua-send-buffer          |
    | C-c C-f | lua-search-documentation |
    | C-c C-c | lua-send-current-line    |
    | M-e     | lua-send-region          |
#+begin_src emacs-lisp :exports none
  (defun kostafey-lua-mode-hook ()
    (define-key lua-mode-map (kbd "C-c C-c") 'lua-send-current-line)
    (define-key lua-mode-map (kbd "M-e") 'lua-send-region)
    (define-key lua-mode-map (kbd "C-x C-e") 'lua-eval-last-expr)
    (define-key lua-mode-map (kbd "C-M-<right>") 'lua-goto-forward)
    (define-key lua-mode-map (kbd "C-M-<left>") 'lua-goto-backward)
    (define-key lua-mode-map (kbd "C-M-S-<right>") 'lua-goto-forward-select)
    (define-key lua-mode-map (kbd "C-M-S-<left>") 'lua-goto-backward-select))
  (add-hook 'lua-mode-hook 'kostafey-lua-mode-hook)
#+end_src

*** Scala
    | Key       | Command                       | Description                              |
    |-----------+-------------------------------+------------------------------------------|
    | C-n j     | ensime                        |                                          |
    | C-c C-v s | ensime-sbt-switch             | Switch to the sbt shell                  |
    | C-n s     | ensime-sbt-switch             | Switch to the sbt shell                  |
    | C-c C-v z | ensime-inf-switch             | Start/switch to scala REPL               |
    | C-n c     | ensime-inf-switch             | Start/switch to scala REPL               |
    | C-c C-v e | ensime-print-errors-at-point  |                                          |
    | C-M-/     | ensime-print-errors-at-point  |                                          |
    | C-c C-v t | ensime-type-at-point          | Echo the type at point to the minibuffer |
    | M-=       | ensime-type-at-point          | Echo the type at point to the minibuffer |
    | C-c C-v b | ensime-inf-eval-buffer        | Send whole buffer to Scala interpreter   |
    | C-n e b   | k/ensime-eval-buffer          | Send whole buffer to Scala interpreter   |
    | C-c C-r   | ensime-inf-eval-region        | Send current region to Scala interpreter |
    | M-e       | ensime-inf-eval-region        | Send current region to Scala interpreter |
    | C-x C-e   | k/ensime-eval-last-scala-expr |                                          |
    | C-n q     | k/ensime-quit                 |                                          |
    | C-n k     | k/ensime-compile              |                                          |
    | C-M-d     | hop-at-point                  | Jump to definition                       |
    | C-c i     | ensime-import-type-at-point   | Suggest possible imports.                |
#+begin_src emacs-lisp :exports none
  ;;----------------------------------------------------------------------
  ;; Scala
  ;;
  (defun kostafey-scala-mode-hook ()
    (define-key scala-mode-map (kbd "C-n j")   'k/scala-start-console)
    (define-key scala-mode-map (kbd "C-n c")   'k/scala-switch-console)
    (define-key scala-mode-map (kbd "M-e")     'k/scala-eval-region)
    (define-key scala-mode-map (kbd "C-n e b") 'k/scala-eval-buffer)
    (define-key scala-mode-map (kbd "C-x C-e") 'k/scala-eval-last-scala-expr)
    (define-key scala-mode-map (kbd "C-c C-e") 'k/scala-eval-line)
    (define-key scala-mode-map (kbd "C-n k")   'k/scala-compile)

    ;; (define-key ensime-mode-map (kbd "C-n q")  'k/ensime-quit)
    ;; (define-key ensime-mode-map (kbd "C-M-d") 'hop-at-point)
    ;; (define-key ensime-mode-map (kbd "C-c i") 'ensime-import-type-at-point)
    )
  (add-hook 'scala-mode-hook 'kostafey-scala-mode-hook)
#+end_src

*** Tcl
    | Key     | Command         | Description |
    |---------+-----------------+-------------|
    | C-c C-t | inferior-tcl    |             |
    | C-c C-f | tcl-load-file   |             |
    | C-c C-v | tcl-eval-defun  |             |
    | C-c C-x | tcl-eval-region |             |
    | M-e     | tcl-eval-region |             |
#+begin_src emacs-lisp :exports none
  ;;----------------------------------------------------------------------
  ;; Tcl
  ;;
  (defun kostafey-tcl-mode-hook ()
    (define-key tcl-mode-map (kbd "M-e") 'tcl-eval-region)
    (define-key tcl-mode-map (kbd "C-c C-c")
      '(lambda() (interactive)
         (save-excursion
           (let ((beg (point))
                 (end (progn
                        (beginning-of-line)
                        (point))))
             (tcl-eval-region end beg))))))
  (add-hook 'tcl-mode-hook 'kostafey-tcl-mode-hook)
#+end_src

*** Golang
#+begin_src emacs-lisp :exports none
  (require 'go-conf)
  (define-key go-mode-map (kbd "C-c C-c") 'go-compile)
  (define-key go-mode-map (kbd "C-c C-e") 'go-run)
  (define-key go-mode-map (kbd "C-x C-e") 'go-run)
#+end_src

*** reStructuredText
#+begin_src emacs-lisp :exports none
  (require 'rst)
  (define-key rst-mode-map (kbd "C-M-a") nil)
#+end_src

*** SQL
#+begin_src emacs-lisp :exports none
  ;;----------------------------------------------------------------------
  ;; SQL
  ;;
  (when (require 'ejc-sql nil 'noerror)
    (eval-after-load "ejc-sql"
      '(progn
         (define-key ejc-sql-mode-keymap (kbd "C-S-s-<up>") '(lambda() (interactive) (ejc-previous-sql t)))
         (define-key ejc-sql-mode-keymap (kbd "C-S-s-<down>") '(lambda() (interactive) (ejc-next-sql t)))
         (define-key ejc-sql-mode-keymap (kbd "C-s-<up>") 'ejc-previous-sql)
         (define-key ejc-sql-mode-keymap (kbd "C-s-<down>") 'ejc-next-sql)
         (global-set-key (kbd "C-x <up>") 'ejc-show-last-result)
         (global-set-key (kbd "C-x C-s") 'ejc-get-temp-editor-buffer)
         (global-set-key (kbd "C-M-<next>") (lambda ()
                                       (interactive)
                                       (if (equal (buffer-name)
                                                  ejc-results-buffer-name)
                                           (ejc-show-next-result))))
         (global-set-key (kbd "C-M-<prior>") (lambda ()
                                               (interactive)
                                               (if (equal (buffer-name)
                                                          ejc-results-buffer-name)
                                                   (ejc-show-prev-result)))))))
  ;;
#+end_src

*** LaTeX
#+begin_src emacs-lisp :exports none
  (defun k/LaTeX-mode-hook ()
    (define-key LaTeX-mode-map  (kbd "C-j") 'join-next-line-space-n))
  (add-hook 'LaTeX-mode-hook 'k/LaTeX-mode-hook)
#+end_src

*** Version control
**** Magit & ahg
    | Key   | Command                    | Description                        |
    |-------+----------------------------+------------------------------------|
    | C-w   | k/kill-current-buffer      | kill current buffer                |
    | M-w   | get-vc-status              | <b>prog-mode</b>: git or hg status |
    | M-w   | diffview-current           | <b>magit-mode</b>: two-window      |
    |       |                            | (side-by-side) comparsion          |
    | S-M-w | magit-copy-buffer-revision | get buffer revision                |
    |       | magit-log-buffer-file      | Show log for the blob or file      |
    |       |                            | visited in the current buffer.     |
#+begin_src emacs-lisp :exports none
  ;;----------------------------------------------------------------------
  ;; Magit & ahg
  ;;
  (global-unset-key (kbd "M-w"))
  (defun kostafey-magit-mode-hook ()
    (define-key magit-mode-map (kbd "C-w") 'eframe-kill-buffer)
    (define-key magit-mode-map (kbd "S-M-w") 'magit-copy-buffer-revision)
    (define-key magit-mode-map (kbd "M-w") 'diffview-current)
    (define-key magit-mode-map (kbd "C-s-<down>") 'magit-section-forward)
    (define-key magit-mode-map (kbd "C-s-<up>") 'magit-section-backward))
  (add-hook 'magit-mode-hook 'kostafey-magit-mode-hook)

    (eval-after-load "diffview"
    '(progn
       (defun do-side-by-side (action)
         (funcall action)
         (other-window 1)
         (funcall action)
         (other-window 1))

       (defun kostafey-diffview-mode-hook ()
         (define-key diffview-mode-map [next]
           '(lambda nil (interactive)
              (do-side-by-side '(lambda nil (pager-page-down)))))
         (define-key diffview-mode-map [prior]
           '(lambda nil (interactive)
              (do-side-by-side '(lambda nil (pager-page-up)))))
         (define-key diffview-mode-map (kbd "C-<up>")
           '(lambda nil (interactive)
              (do-side-by-side '(lambda nil (scroll-down-line 1)))))
         (define-key diffview-mode-map (kbd "C-<down>")
           '(lambda nil (interactive)
              (do-side-by-side '(lambda nil (scroll-up-line 1)))))
         (define-key diffview-mode-map (kbd "<mouse-4>")
           '(lambda nil (interactive)
              (do-side-by-side '(lambda nil (scroll-down-line 1)))))
         (define-key diffview-mode-map (kbd "<mouse-5>")
           '(lambda nil (interactive)
              (do-side-by-side '(lambda nil (scroll-up-line 1))))))
       (add-hook 'diffview-mode-hook 'kostafey-diffview-mode-hook)))

  (eval-after-load "version-control"
    '(progn
       (global-set-key (kbd "M-w") 'get-vc-status)))

  (eval-after-load "ahg"
    '(progn
       (define-key ahg-status-mode-map [tab] 'ahg-status-diff)))
  ;;
  ;;=============================================================================
#+end_src

**** git-gutter
    | Key                | Command                  |
    |--------------------+--------------------------|
    | C-M-g &lt;down&gt; | git-gutter:next-hunk     |
    | C-M-g &lt;down&gt; | git-gutter:previous-hunk |
    | C-M-g p            | git-gutter:popup-hunk    |
#+begin_src emacs-lisp :exports none
  (when (require 'git-gutter nil 'noerror)
    (global-set-key (kbd "C-M-g <down>") 'git-gutter:next-hunk)
    (global-set-key (kbd "C-M-g <up>") 'git-gutter:previous-hunk)
    (global-set-key (kbd "C-M-g p") 'git-gutter:popup-hunk))
#+end_src

