custom/key-bindings.el

(defun kostafey-lua-mode-hook ()
  (define-key lua-mode-map (kbd "C-c C-c") 'lua-send-current-line)
  (define-key lua-mode-map (kbd "M-e") 'lua-send-region)
  (define-key lua-mode-map (kbd "C-x C-e") 'lua-eval-last-expr)
  (define-key lua-mode-map (kbd "C-M-<right>") 'lua-goto-forward)
  (define-key lua-mode-map (kbd "C-M-<left>") 'lua-goto-backward)
  (define-key lua-mode-map (kbd "C-M-S-<right>") 'lua-goto-forward-select)
  (define-key lua-mode-map (kbd "C-M-S-<left>") 'lua-goto-backward-select))
(add-hook 'lua-mode-hook 'kostafey-lua-mode-hook)

;;----------------------------------------------------------------------
;; Scala
;;
(defun kostafey-scala-mode-hook ()
  (define-key scala-mode-map (kbd "C-n j")   'k/scala-start-console)
  (define-key scala-mode-map (kbd "C-n c")   'k/scala-switch-console)
  (define-key scala-mode-map (kbd "M-e")     'k/scala-eval-region)
  (define-key scala-mode-map (kbd "C-n e b") 'k/scala-eval-buffer)
  (define-key scala-mode-map (kbd "C-x C-e") 'k/scala-eval-last-scala-expr)
  (define-key scala-mode-map (kbd "C-c C-e") 'k/scala-eval-line)
  (define-key scala-mode-map (kbd "C-n k")   'k/scala-compile)

  ;; (define-key ensime-mode-map (kbd "C-n q")  'k/ensime-quit)
  ;; (define-key ensime-mode-map (kbd "C-M-d") 'hop-at-point)
  ;; (define-key ensime-mode-map (kbd "C-c i") 'ensime-import-type-at-point)
  )
(add-hook 'scala-mode-hook 'kostafey-scala-mode-hook)

;;----------------------------------------------------------------------
;; Tcl
;;
(defun kostafey-tcl-mode-hook ()
  (define-key tcl-mode-map (kbd "M-e") 'tcl-eval-region)
  (define-key tcl-mode-map (kbd "C-c C-c")
    '(lambda() (interactive)
       (save-excursion
         (let ((beg (point))
               (end (progn
                      (beginning-of-line)
                      (point))))
           (tcl-eval-region end beg))))))
(add-hook 'tcl-mode-hook 'kostafey-tcl-mode-hook)

(require 'go-conf)
(define-key go-mode-map (kbd "C-c C-c") 'go-compile)
(define-key go-mode-map (kbd "C-c C-e") 'go-run)
(define-key go-mode-map (kbd "C-x C-e") 'go-run)

(require 'rst)
(define-key rst-mode-map (kbd "C-M-a") nil)

;;----------------------------------------------------------------------
;; SQL
;;
(when (require 'ejc-sql nil 'noerror)
  (eval-after-load "ejc-sql"
    '(progn
       (define-key ejc-sql-mode-keymap (kbd "C-S-s-<up>") '(lambda() (interactive) (ejc-previous-sql t)))
       (define-key ejc-sql-mode-keymap (kbd "C-S-s-<down>") '(lambda() (interactive) (ejc-next-sql t)))
       (define-key ejc-sql-mode-keymap (kbd "C-s-<up>") 'ejc-previous-sql)
       (define-key ejc-sql-mode-keymap (kbd "C-s-<down>") 'ejc-next-sql)
       (global-set-key (kbd "C-x <up>") 'ejc-show-last-result)
       (global-set-key (kbd "C-x C-s") 'ejc-get-temp-editor-buffer)
       (global-set-key (kbd "C-M-<next>") (lambda ()
                                     (interactive)
                                     (if (equal (buffer-name)
                                                ejc-results-buffer-name)
                                         (ejc-show-next-result))))
       (global-set-key (kbd "C-M-<prior>") (lambda ()
                                             (interactive)
                                             (if (equal (buffer-name)
                                                        ejc-results-buffer-name)
                                                 (ejc-show-prev-result)))))))
;;

(defun k/LaTeX-mode-hook ()
  (define-key LaTeX-mode-map  (kbd "C-j") 'join-next-line-space-n))
(add-hook 'LaTeX-mode-hook 'k/LaTeX-mode-hook)

;;----------------------------------------------------------------------
;; Magit & ahg
;;
(global-unset-key (kbd "M-w"))
(defun kostafey-magit-mode-hook ()
  (define-key magit-mode-map (kbd "C-w") 'eframe-kill-buffer)
  (define-key magit-mode-map (kbd "S-M-w") 'magit-copy-buffer-revision)
  (define-key magit-mode-map (kbd "M-w") 'diffview-current)
  (define-key magit-mode-map (kbd "C-s-<down>") 'magit-section-forward)
  (define-key magit-mode-map (kbd "C-s-<up>") 'magit-section-backward))
(add-hook 'magit-mode-hook 'kostafey-magit-mode-hook)

  (eval-after-load "diffview"
  '(progn
     (defun do-side-by-side (action)
       (funcall action)
       (other-window 1)
       (funcall action)
       (other-window 1))

     (defun kostafey-diffview-mode-hook ()
       (define-key diffview-mode-map [next]
         '(lambda nil (interactive)
            (do-side-by-side '(lambda nil (pager-page-down)))))
       (define-key diffview-mode-map [prior]
         '(lambda nil (interactive)
            (do-side-by-side '(lambda nil (pager-page-up)))))
       (define-key diffview-mode-map (kbd "C-<up>")
         '(lambda nil (interactive)
            (do-side-by-side '(lambda nil (scroll-down-line 1)))))
       (define-key diffview-mode-map (kbd "C-<down>")
         '(lambda nil (interactive)
            (do-side-by-side '(lambda nil (scroll-up-line 1)))))
       (define-key diffview-mode-map (kbd "<mouse-4>")
         '(lambda nil (interactive)
            (do-side-by-side '(lambda nil (scroll-down-line 1)))))
       (define-key diffview-mode-map (kbd "<mouse-5>")
         '(lambda nil (interactive)
            (do-side-by-side '(lambda nil (scroll-up-line 1))))))
     (add-hook 'diffview-mode-hook 'kostafey-diffview-mode-hook)))

(eval-after-load "version-control"
  '(progn
     (global-set-key (kbd "M-w") 'get-vc-status)
     (global-set-key (kbd "C-M-w") 'k/multy-magit-status)))

(eval-after-load "ahg"
  '(progn
     (define-key ahg-status-mode-map [tab] 'ahg-status-diff)))
;;
;;=============================================================================

(when (require 'git-gutter nil 'noerror)
  (global-set-key (kbd "C-M-g <down>") 'git-gutter:next-hunk)
  (global-set-key (kbd "C-M-g <up>") 'git-gutter:previous-hunk)
  (global-set-key (kbd "C-M-g p") 'git-gutter:popup-hunk))
