custom/key-bindings.org
**** Smerge
    | Key       | Command             | Description                 |
    |-----------+---------------------+-----------------------------|
    | C-c s n   | smerge-next         | Go to the next conflict     |
    | C-c s p   | smerge-prev         | Go to the previous conflict |
    | C-c s RET | smerge-keep-current | Use version the cursor      |
    | C-c s u   | smerge-keep-upper   | Keep the "upper" version    |
    | C-c s l   | smerge-keep-lower   | Keep the "lower" version    |
#+begin_src emacs-lisp :exports none
  (setq smerge-command-prefix (kbd "C-c s"))
  (define-key smerge-mode-map (kbd "C-c s n") 'smerge-next)
  (define-key smerge-mode-map (kbd "C-c s p") 'smerge-prev)
  (define-key smerge-mode-map (kbd "C-c s RET") 'smerge-keep-current)
  (define-key smerge-mode-map (kbd "C-c s u") 'smerge-keep-upper)
  (define-key smerge-mode-map (kbd "C-c s l") 'smerge-keep-lower)
#+end_src

** Mouse
#+begin_src emacs-lisp :exports none
  ;;=============================================================================
  ;;                               Mouse
  ;;
  ;; Select by mouse and shift
  ;;-----------------------------------------------------------------------------
  ;; shift + click select region
  (define-key global-map (kbd "<S-down-mouse-1>") 'ignore) ; turn off font dialog
  (define-key global-map (kbd "<S-mouse-1>") '(lambda (e)
                                                (interactive "e")
                                                (if (not mark-active)
                                                    (cua-set-mark))
                                                (mouse-set-point e)))
  ;;-----------------------------------------------------------------------------
  ;; ctrl + shift + click select rectange region
  (global-unset-key (kbd "<C-S-down-mouse-1>"))
  (global-set-key (kbd "<C-S-mouse-1>") 'hkb-mouse-mark-cua-rectangle)
  (define-key cua--rectangle-keymap (kbd "<C-S-mouse-1>") 'hkb-mouse-mark-cua-rectangle)
  ;; (global-set-key (kbd "<C-down-mouse-1>") 'hop-by-mouse)
  (global-set-key (kbd "<C-mouse-1>") 'hop-by-mouse)
  ;;
  ;;=============================================================================

  (provide 'key-bindings)
#+end_src

** Menu
*** header_name
    | Key | Command     | Description |
    |-----+-------------+-------------|
    | M-` | tmm-menubar | Text menu   |

** Org-mode
*** Time schedule
    | Key         | Command          | Description                         |
    |-------------+------------------+-------------------------------------|
    | C-c C-t     | org-todo         | Change the TODO state of an item    |
    | C-x t       | org-todo         | Change the TODO state of an item    |
    | C-c C-x C-i | org-clock-in     | Start the clock on the current item |
    | C-c C-x C-o | org-clock-out    | Stop the currently running clock    |
    | C-c C-x C-r | org-clock-report | Create a table containing a report  |
    |             |                  | about clocked time                  |
#+begin_src emacs-lisp :exports none
  (define-key org-mode-map (kbd "C-x t") 'org-todo)
  (global-set-key (kbd "C-c l") 'org-store-link)
  (global-set-key (kbd "C-c a") 'org-agenda)
  (global-set-key (kbd "C-c b") 'org-switchb)
#+end_src

** Emacs OS
*** Dired
#+begin_src emacs-lisp :exports none
  (define-key dired-mode-map [f1] nil)
  (define-key dired-mode-map (kbd "M-z") nil)
  (define-key dired-mode-map (kbd "M-p")
    'copy-to-clipboard-dired-current-directory)
  (define-key dired-mode-map (kbd "C-<home>") 'dired-home)
  (define-key dired-mode-map (kbd "C-<end>") 'dired-end)
  (define-key dired-mode-map (kbd "C-<up>") 'diredp-up-directory-reuse-dir-buffer)
  (define-key dired-mode-map (kbd "C-<down>") 'diredp-find-file-reuse-dir-buffer)
#+end_src
*** elfeed
#+begin_src emacs-lisp :exports none
   ;; see https://github.com/skeeto/elfeed for details.
   (global-set-key (kbd "M-<f2>") 'elfeed)
#+end_src

