custom/key-bindings.el

(setq smerge-command-prefix (kbd "C-c s"))
(define-key smerge-mode-map (kbd "C-c s n") 'smerge-next)
(define-key smerge-mode-map (kbd "C-c s p") 'smerge-prev)
(define-key smerge-mode-map (kbd "C-c s RET") 'smerge-keep-current)
(define-key smerge-mode-map (kbd "C-c s u") 'smerge-keep-upper)
(define-key smerge-mode-map (kbd "C-c s l") 'smerge-keep-lower)

;;=============================================================================
;;                               Mouse
;;
;; Select by mouse and shift
;;-----------------------------------------------------------------------------
;; shift + click select region
(define-key global-map (kbd "<S-down-mouse-1>") 'ignore) ; turn off font dialog
(define-key global-map (kbd "<S-mouse-1>") '(lambda (e)
                                              (interactive "e")
                                              (if (not mark-active)
                                                  (cua-set-mark))
                                              (mouse-set-point e)))
;;-----------------------------------------------------------------------------
;; ctrl + shift + click select rectange region
(global-unset-key (kbd "<C-S-down-mouse-1>"))
(global-set-key (kbd "<C-S-mouse-1>") 'hkb-mouse-mark-cua-rectangle)
(define-key cua--rectangle-keymap (kbd "<C-S-mouse-1>") 'hkb-mouse-mark-cua-rectangle)
;; (global-set-key (kbd "<C-down-mouse-1>") 'hop-by-mouse)
(global-set-key (kbd "<C-mouse-1>") 'hop-by-mouse)
;;
;;=============================================================================

(provide 'key-bindings)

(define-key org-mode-map (kbd "C-x t") 'org-todo)
(global-set-key (kbd "C-c l") 'org-store-link)
(global-set-key (kbd "C-c a") 'org-agenda)
(global-set-key (kbd "C-c b") 'org-switchb)

(define-key dired-mode-map [f1] nil)
(define-key dired-mode-map (kbd "M-z") nil)
(define-key dired-mode-map (kbd "M-p")
  'copy-to-clipboard-dired-current-directory)
(define-key dired-mode-map (kbd "C-<home>") 'dired-home)
(define-key dired-mode-map (kbd "C-<end>") 'dired-end)
(define-key dired-mode-map (kbd "C-<up>") 'diredp-up-directory-reuse-dir-buffer)
(define-key dired-mode-map (kbd "C-<down>") 'diredp-find-file-reuse-dir-buffer)

;; see https://github.com/skeeto/elfeed for details.
(global-set-key (kbd "M-<f2>") 'elfeed)
